
{
  "title":"Study Materials",
  "content":" Introduction Xv6 is a teaching operating system developed in the summer of 2006 for MIT\u0026rsquo;s operating systems course, 6.828: Operating System Engineering. We hope that xv6 will be useful in other courses too. This page collects resources to aid the use of xv6 in other courses, including a commentary on the source code itself.\nHistory and Background For many years, MIT had no operating systems course. In the fall of 2002, one was created to teach operating systems engineering. In the course lectures, the class worked through Sixth Edition Unix (aka V6) using John Lions\u0026rsquo;s famous commentary. In the lab assignments, students wrote most of an exokernel operating system, eventually named Jos, for the Intel x86. Exposing students to multiple systems–V6 and Jos–helped develop a sense of the spectrum of operating system designs.\nV6 presented pedagogic challenges from the start. Students doubted the relevance of an obsolete 30-year-old operating system written in an obsolete programming language (pre-K\u0026amp;R C) running on obsolete hardware (the PDP-11). Students also struggled to learn the low-level details of two different architectures (the PDP-11 and the Intel x86) at the same time. By the summer of 2006, we had decided to replace V6 with a new operating system, xv6, modeled on V6 but written in ANSI C and running on multiprocessor Intel x86 machines. Xv6\u0026rsquo;s use of the x86 makes it more relevant to students\u0026rsquo; experience than V6 was and unifies the course around a single architecture. Adding multiprocessor support requires handling concurrency head on with locks and threads (instead of using special-case solutions for uniprocessors such as enabling / disabling interrupts) and helps relevance. Finally, writing a new system allowed us to write cleaner versions of the rougher parts of V6, like the scheduler and file system. 6.828 substituted xv6 for V6 in the fall of 2006.\nXv6 Sources and Text The latest xv6 source is available via\ngit clone git://pdos.csail.mit.edu/xv6/xv6.git\nWe also distribute the sources as a printed booklet with line numbers that keep everyone together during lectures. The booklet is available in the lecture notes section. To get the version corresponding to this booklet, run\ngit checkout -b xv6-rev7 xv6-rev7\nThe xv6 source code is licensed under the traditional MIT license; see the LICENSE file in the source distribution. To help students read through xv6 and learn about the main ideas in operating systems we also distribute a textbook / commentary for the latest xv6, available in the lecture notes section. The line numbers in this book refer to the above source booklet.\nxv6 compiles using the GNU C compiler, targeted at the x86 using ELF binaries. On BSD and Linux systems, you can use the native compilers; On OS X, which doesn\u0026rsquo;t use ELF binaries, you must use a cross-compiler. Xv6 does boot on real hardware, but typically we run it using the QEMU emulator. Both the GCC cross compiler and QEMU can be found on the 6.828 tools page.\nXv6 Lecture Material In 6.828, the lectures in the first half of the course cover the xv6 sources and text. The lectures in the second half consider advanced topics using research papers; for some, xv6 serves as a useful base for making discussions concrete.\nUnix Version 6 6.828\u0026rsquo;s xv6 is inspired by Unix V6 and by:\nLions, John. Lions\u0026rsquo; Commentary on UNIX. 6th ed. Peer to Peer Communications, 1977. ISBN: 9781573980135. An on-line version of the Lions commentary, and the source code. The v6 source code is also available online through the PDP Unix Preservation Society. The following are useful to read the original code:\nDigital Equipment. The PDP11 / 40 Processor Handbook. Digital Equipment Corporation, 1972. "}


