
{
  "title":"Lecture Notes and Readings",
  "content":"Some of the readings require the xv6 code (PDF), as well as the xv6 book (PDF - 1.3MB), which are provided courtesy of Frans Kaashoek, Robert Morris, and Russ Cox and are used here with permission.\nLEC # LECTURE TOPICS AND NOTES READINGS AND HANDOUTS 1 Operating Systems (PDF) \u0026ldquo;Chapter 0: Operating System Interfaces\u0026rdquo; of xv6 book 2 PC Hardware and x86 Programming (PDF) \u0026ldquo;Appendix A: PC Hardware\u0026rdquo; and \u0026ldquo;Appendix B: The Boot Loader\u0026rdquo; of xv6 book, and the related xv6 source files 3 Overview of Major Internals, System Call Interface (PDF) \u0026ldquo;Chapter 1: The first process\u0026rdquo; and the related xv6 source files 4 Virtual Memory (PDF) \u0026ldquo;Chapter 2: Page Tables\u0026rdquo;\nPage Table Translation and Registers (PDF)\n5 Interrupts, Exceptions (PDF) \u0026ldquo;Chapter 3: Traps, interrupts, and drivers\u0026rdquo; and the related xv6 source files\nIDT (PDF)\n6 Multiprocessors and Locking (PDF) \u0026ldquo;Chapter 4: Locking\u0026rdquo; with spinlock.c and skim mp.c 7 Processes and Switching (PDF) \u0026ldquo;Chapter 5: Scheduling\u0026rdquo; up to \u0026ldquo;Sleep and wakeup\u0026rdquo; with proc.c, setjmp.S, and sys_fork (in sysproc.c) 8 Sleep \u0026amp; Wakeup (PDF) Read remainder of \u0026ldquo;Chapter 5: Scheduling\u0026rdquo;; read remainder of proc.c and sys_wait, sys_exit, sys_kill 9 File Systems (PDF) \u0026ldquo;Chapter 6: File system\u0026rdquo; and bio.c, fs.c, sysfile.c, file.c, except for the logging sections 10 Crash Recovery (PDF) Read log.c and the logging sections of \u0026ldquo;Chapter 6: File system\u0026rdquo; 11 File System Performance and Fast Crash Recovery (PDF) Tweedie, Stephen C. \u0026ldquo;Journaling the Linux ext2fs Filesystem.\u0026rdquo; [Paper Presented at LinuxExpo 1998]. 12 Project Introduction and Discussion 13 OS Organization (PDF) Engler, Dawson R., M. Frans Kaashoek, and James O\u0026rsquo;Toole Jr. \u0026ldquo;Exokernel: An Operating System Architecture for Application-Level Resource Management.\u0026rdquo; 14 In-class Hacking Session 15 Project Conferences 16 Project Conferences (cont.) 17 Language / OS Co-design (PDF) Hunt, Galen C., and James R. Larus. \u0026ldquo;Singularity: Rethinking the Software Stack.\u0026rdquo; Microsoft Research Redmond 41, no. 2 (2007): 37–49. Quiz Quiz (Open Book and Notes) 18 Scalable Locks (PDF) Boyd-Wickizer, Silas, M. Frans Kaashoek, et al. \u0026ldquo;Non-Scalable Locks are Dangerous.\u0026rdquo; 19 Project Conferences 20 Project Conferences (cont.) Boyd-Wickizer, Silas, Austin T. Clements, et al. \u0026ldquo;An Analysis of Linux Scalability to Many Cores.\u0026rdquo; 21 Lock-free Coordination (PDF) 22 Virtual Machines (PDF) Adams, Keith, and Ole Agesen. \u0026ldquo;A Comparison of Software and Hardware Techniques for x86 Virtualization.\u0026rdquo; ACM Digital Library 34, no. 5 (2006): 2–13. 23 No lecture; work on final projects 24 Demos in class 25 Demos in class (cont.) "}


